Core/src/Documents/Визит/Визит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Визит</name>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ОПТИМУС_ТорговыеТочки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервированиеЗапасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокРеализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРедактировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаДляВозврата</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяСинхронизация</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказПокупателя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратОтПокупателя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реализация</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказНаВозврат</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнутреннийЗаказ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнутреннийЗаказ1</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/УчетнаяПолитикаРегл/УчетнаяПолитикаРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаРегл</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>СчетНезавершенноеПроизводство</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорРозничногоКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДСРозничныхПродаж</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрибыльУбытки</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДеньгиВПути</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыль</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыльПодлежащийОплате</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортВозвратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетТранзитногоСклада</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ВидНадогаДляСчетовНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДФЛСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратПФСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажа</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажаСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийЗаказПокупателя/ВидыОперацийЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказПокупателя</name>
  <enumValues>
    <name>ЗаказНаПродажу</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаряд</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>ОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НаЭкспорт</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриходнаяНакладная</name>
  <enumValues>
    <name>ПоступлениеОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПриемВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаКапитальныхЗатрат</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетов</name>
  <enumValues>
    <name>Долг</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/Визит/ManagerModule.bsl
Функция СоздатьСвязанныеДокументы(ДокументСсылка) Экспорт 
	
	СтруктураСДокументами = Новый Структура();
	                                                           
	СтруктураСДокументами.Вставить("ЗаказПокупателя", НайтиИлиСоздатьДокументЗаказа(ДокументСсылка));
	
	СтруктураСДокументами.Вставить("ПриходнаяНакладная", НайтиИлиСоздатьДокументВозврата(ДокументСсылка));
	
	СтруктураСДокументами.Вставить("РасходнаяНакладная", НайтиИлиСоздатьДокументРеализации(ДокументСсылка));
	
	СтруктураСДокументами.Вставить("ПоступлениеВКассу", НайтиИлиСоздатьДокументПКО(ДокументСсылка));

	СтруктураСДокументами.Вставить("ЗаказНаВозврат", НайтиИлиСоздатьДокументЗаказНаВозврат(ДокументСсылка));
	
	СтруктураСДокументами.Вставить("ВнутреннийЗаказ", НайтиИлиСоздатьДокументВнутреннийЗаказ(ДокументСсылка));

	Возврат СтруктураСДокументами;
	
КонецФункции

Функция НайтиИлиСоздатьДокументЗаказа(ДокументСсылка) Экспорт
	
	Документ = Документы.ЗаказПокупателя.НайтиПоРеквизиту("ДокументВизита", ДокументСсылка);
	
	// Если документ не был найден то создадим его
	Если Документ.Пустая() Тогда 
	    ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
		ДокументОбъект.ДокументВизита = ДокументСсылка;
	Иначе 
		ДокументОбъект = Документ.ПолучитьОбъект();		
	КонецЕсли;
	
	ДокументОбъект.Запасы.Очистить();
	
	Если ДокументСсылка.ЗаказПокупателя.Количество() > 0 Тогда 
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
		
		СостояниеДокумента = "";
		КартинкаСостоянияДокумента = 0;
		РазрешеноПроведение = Истина;
		
		УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
			ДокументОбъект, 
			ДокументОбъект.ВидОперации,
			Документы.ЗаказПокупателя.ПустаяСсылка(), // Пустая ссылка на документ для парамента копирования
			Неопределено,  // Основание для создания
			РазрешеноПроведение,
			Новый Структура() // Параметры заполнения
		);
		
		// Заполним реквизиты по документу "Визит"
		ДокументОбъект.Дата			= ДокументСсылка.Дата;
		ДокументОбъект.ДатаОтгрузки	= КонецДня(ДокументСсылка.Дата) + 1; // Отгрузка по плану на следующий день
		ДокументОбъект.Автор		= ДокументСсылка.Автор;
		ДокументОбъект.ТорговаяТочка= ДокументСсылка.ТорговаяТочка;
		ДокументОбъект.Комментарий	= ДокументСсылка.Комментарий;
		ДокументОбъект.Ответственный= ДокументСсылка.Ответственный;
		
		ДокументОбъект.Контрагент	= ДокументСсылка.Контрагент;
		ДокументОбъект.Договор		= ДокументСсылка.Договор;
		ДокументОбъект.Организация	= ДокументОбъект.Договор.Организация;
		ДокументОбъект.Касса		= ДокументСсылка.Касса;
		//ДокументОбъект.СостояниеЗаказа = Константы.СостояниеВРаботеЗаказовПокупателей.Получить();
		//ДокументОбъект.Закрыт = Ложь;
		
		// Заполним валюту и курс по валюте из договора
		ДокументОбъект.ВалютаДокумента= ДокументОбъект.Договор.ВалютаРасчетов;
		ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", ДокументОбъект.Договор.ВалютаРасчетов));
		ДокументОбъект.Курс			= ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
		ДокументОбъект.Кратность		= ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
		ДокументОбъект.ВидСкидкиНаценки	= ДокументОбъект.Договор.ВидСкидкиНаценки;
		//ДокументОбъект.ВидЦен			= ДокументОбъект.Договор.ВидЦен;
		Если ЗначениеЗаполнено(ДокументСсылка.ВидЦен) Тогда
		    ДокументОбъект.ВидЦен				= ДокументСсылка.ВидЦен;
		Иначе
			ДокументОбъект.ВидЦен				= ДокументОбъект.Договор.ВидЦен;
		КонецЕсли; 

		ДокументОбъект.СуммаВключаетНДС	= ДокументОбъект.ВидЦен.ЦенаВключаетНДС;
		
		// Найдём банковский счет и кассу по организации и валюте		
		// Если основной банковский счет организации имеет туже валюту что валюта документа используем его в документе
		Если ДокументОбъект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = ДокументОбъект.ВалютаДокумента Тогда 
			ДокументОбъект.БанковскийСчет = ДокументОбъект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
		КонецЕсли;
				
		//ДокументОбъект.НалогообложениеНДС = ПроведениеНДС_И_RSGE.ПолучитьЗначечениеНалогооблажение(ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.Договор, ДокументОбъект.Дата, Истина);
		
		// Заполним товары
		Для Каждого Эл Из ДокументСсылка.ЗаказПокупателя Цикл
			СтрокаЗапасы = ДокументОбъект.Запасы.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Эл);
			
			// Заполним единицу измерения  базовой единице (в документе визит нет единицы!!!)
			СтрокаЗапасы.ЕдиницаИзмерения	= СтрокаЗапасы.Номенклатура.ЕдиницаИзмерения;
			
			// Расчет суммы НДС
			СтрокаЗапасы.СтавкаНДС	= СтрокаЗапасы.Номенклатура.СтавкаНДС;
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаЗапасы.СтавкаНДС);
			
			Если ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда 
				СтрокаЗапасы.СуммаНДС = ?(ДокументОбъект.СуммаВключаетНДС, СтрокаЗапасы.Сумма - (СтрокаЗапасы.Сумма) / ((СтавкаНДС + 100) / 100),
										  							СтрокаЗапасы.Сумма * СтавкаНДС / 100);
			Иначе
				СтрокаЗапасы.СуммаНДС = 0;
			КонецЕсли;
			
			СтрокаЗапасы.Всего		= ?(ДокументОбъект.СуммаВключаетНДС, СтрокаЗапасы.Сумма, СтрокаЗапасы.Сумма + СтрокаЗапасы.СуммаНДС);
			
			СтрокаЗапасы.ЭтоПодарок=Эл.Подарок;
		КонецЦикла;

		// Если документ был помечен на удаление снимим пометку
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;

		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
	Иначе
		
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
		    ДокументОбъект.УстановитьПометкуУдаления(Истина);
		    ДокументОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДокументОбъект.Ссылка;	
КонецФункции

Функция НайтиИлиСоздатьДокументВозврата(ДокументСсылка) Экспорт
	Документ = Документы.ПриходнаяНакладная.НайтиПоРеквизиту("ДокументВизита", ДокументСсылка);
	
	// Если документ не был найден то создадим его
	Если Документ.Пустая() Тогда 
	    ДокументОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
		ДокументОбъект.ДокументВизита = ДокументСсылка;
	Иначе 
		ДокументОбъект = Документ.ПолучитьОбъект();
	КонецЕсли;
	
	ДокументОбъект.Запасы.Очистить();
	
	Если ДокументСсылка.ВозвратОтПокупателя.Количество() > 0 Тогда 	
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
		
		СостояниеДокумента = "";
		КартинкаСостоянияДокумента = 0;
		РазрешеноПроведение = Истина;
		
		УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
			ДокументОбъект, 
			ДокументОбъект.ВидОперации,
			Документы.ПриходнаяНакладная.ПустаяСсылка(), // Пустая ссылка на документ для парамента копирования
			Неопределено,  // Основание для создания
			СостояниеДокумента,
			Новый Структура() // Параметры заполнения
		);
		
		// Заполним реквизиты по документу "Визит"
		ДокументОбъект.Дата			= ДокументСсылка.Дата + 1;
		ДокументОбъект.Автор		= ДокументСсылка.Автор;
		ДокументОбъект.ТорговаяТочка= ДокументСсылка.ТорговаяТочка;
		ДокументОбъект.Комментарий	= ДокументСсылка.Комментарий;
		ДокументОбъект.Ответственный= ДокументСсылка.Ответственный;
		
		ДокументОбъект.Контрагент	= ДокументСсылка.Контрагент;
		ДокументОбъект.Договор		= ДокументСсылка.Договор;
		ДокументОбъект.Организация	= ДокументОбъект.Договор.Организация;
		ДокументОбъект.СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
		
		// Заполним валюту и курс по валюте из договора
		ДокументОбъект.ВалютаДокумента= ДокументОбъект.Договор.ВалютаРасчетов;
		ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", ДокументОбъект.Договор.ВалютаРасчетов));
		ДокументОбъект.Курс			= ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
		ДокументОбъект.Кратность		= ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
		ДокументОбъект.СуммаВключаетНДС	= ДокументОбъект.Договор.ВидЦен.ЦенаВключаетНДС;
		
		// Найдём банковский счет и кассу по организации и валюте		
		// Если основной банковский счет организации имеет туже валюту что валюта документа используем его в документе
		//Если ДокументОбъект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = ДокументОбъект.ВалютаДокумента Тогда 
		//	ДокументОбъект.БанковскийСчет = ДокументОбъект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
		//КонецЕсли;
		
		//ДокументОбъект.НалогообложениеНДС = ПроведениеНДС_И_RSGE.ПолучитьЗначечениеНалогооблажение(ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.Договор, ДокументОбъект.Дата, Истина);
		
		// Заполним товары
		ЗапасыВозврата = ДокументСсылка.ВозвратОтПокупателя.Выгрузить();
		//ЗапасыВозврата.Колонки.Добавить("Характеристика" );
		//ЗапасыВозврата.ЗаполнитьЗначения(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),"Характеристика");
		ДокументОбъект.Дистрибуция_ЗаполнитьПродажамиНаСервере(ЗапасыВозврата);
		
		//Для Каждого Эл Из ДокументСсылка.ВозвратОтПокупателя Цикл
		//	СтрокаЗапасы = ДокументОбъект.Запасы.Добавить();
		//	
		//	ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Эл);
		//	
		//	// Заполним единицу измерения  базовой единице (в документе визит нет единицы!!!)
		//	СтрокаЗапасы.ЕдиницаИзмерения	= СтрокаЗапасы.Номенклатура.ЕдиницаИзмерения;
		//	
		//	// Расчет суммы НДС
		//	СтрокаЗапасы.СтавкаНДС	= СтрокаЗапасы.Номенклатура.СтавкаНДС;
		//	
		//	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаЗапасы.СтавкаНДС);
		//	
		//	Если ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда 
		//		СтрокаЗапасы.СуммаНДС = ?(ДокументОбъект.СуммаВключаетНДС, СтрокаЗапасы.Сумма - (СтрокаЗапасы.Сумма) / ((СтавкаНДС + 100) / 100),
		//								  							СтрокаЗапасы.Сумма * СтавкаНДС / 100);
		//	Иначе
		//		СтрокаЗапасы.СуммаНДС = 0;
		//	КонецЕсли;
		//	
		//	СтрокаЗапасы.Всего		= ?(ДокументОбъект.СуммаВключаетНДС, СтрокаЗапасы.Сумма, СтрокаЗапасы.Сумма + СтрокаЗапасы.СуммаНДС);
		//КонецЦикла;	
	
		// Если документ был помечен на удаление снимим пометку
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
		    ДокументОбъект.УстановитьПометкуУдаления(Истина);
		    ДокументОбъект.Записать();
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ДокументОбъект.Ссылка;	
КонецФункции

Функция НайтиИлиСоздатьДокументРеализации(ДокументСсылка) Экспорт
	Документ = Документы.РасходнаяНакладная.НайтиПоРеквизиту("ДокументВизита", ДокументСсылка);
	
	// Если документ не был найден то создадим его
	Если Документ.Пустая() Тогда 
	    ДокументОбъект = Документы.РасходнаяНакладная.СоздатьДокумент();
		ДокументОбъект.ДокументВизита = ДокументСсылка;
	Иначе 
		ДокументОбъект = Документ.ПолучитьОбъект();
	КонецЕсли;
	
	ДокументОбъект.Запасы.Очистить();
	
	Если ДокументСсылка.Реализация.Количество() > 0 Тогда	
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
		
		СостояниеДокумента = "";
		КартинкаСостоянияДокумента = 0;
		РазрешеноПроведение = Истина;
		
		УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
			ДокументОбъект, 
			ДокументОбъект.ВидОперации,
			Документы.РасходнаяНакладная.ПустаяСсылка(), // Пустая ссылка на документ для парамента копирования
			Неопределено,  // Основание для создания
			СостояниеДокумента,
			Новый Структура() // Параметры заполнения
		);
		
		// Заполним реквизиты по документу "Визит"
		ДокументОбъект.Дата			= ДокументСсылка.Дата;
		ДокументОбъект.Автор		= ДокументСсылка.Автор;
		ДокументОбъект.ТорговаяТочка= ДокументСсылка.ТорговаяТочка;
		ДокументОбъект.Комментарий	= ДокументСсылка.Комментарий;
		ДокументОбъект.Ответственный= ДокументСсылка.Ответственный;
		ДокументОбъект.ВидЭлектронногоДокумента = Перечисления.ВидыЭД.ТОРГ12Продавец;
		
		ДокументОбъект.Контрагент	= ДокументСсылка.Контрагент;
		ДокументОбъект.Договор		= ДокументСсылка.Договор;
		ДокументОбъект.Организация	= ДокументОбъект.Договор.Организация;
		ДокументОбъект.СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
			
		СтруктураСчетовКурсРазниц = РегистрыСведений.УчетнаяПолитикаРегл.СоздатьМенеджерЗаписи();
		СтруктураСчетовКурсРазниц.Организация = ?(НЕ ЗначениеЗаполнено(ДокументОбъект.Организация), УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация"), ДокументОбъект.Организация);
		СтруктураСчетовКурсРазниц.Период = ?(НЕ ЗначениеЗаполнено(ДокументОбъект.Дата), ТекущаяДата(),ДокументОбъект.Дата);
		СтруктураСчетовКурсРазниц.Прочитать();
		Если СтруктураСчетовКурсРазниц.Выбран() Тогда
			ДокументОбъект.СчетЗатратБезвозмезднойПродажи 			= СтруктураСчетовКурсРазниц.СчетЗатратБезвозмезднойПродажи;
			ДокументОбъект.СчетЗатратНДСБезвозмезднойПродажи   		= СтруктураСчетовКурсРазниц.СчетЗатратНДСБезвозмезднойПродажи;
			ДокументОбъект.СчетУчетаНалогаНаПрибыль     			= СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыль;
			ДокументОбъект.СчетУчетаНалогаНаПрибыльПодлежащийОплате = СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыльПодлежащийОплате;
		КонецЕсли;	

		// Заполним валюту и курс по валюте из договора
		ДокументОбъект.ВалютаДокумента	= ДокументОбъект.Договор.ВалютаРасчетов;
		ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", ДокументОбъект.Договор.ВалютаРасчетов));
		ДокументОбъект.Курс			= ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
		ДокументОбъект.Кратность			= ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
		ДокументОбъект.ВидСкидкиНаценки		= ДокументОбъект.Договор.ВидСкидкиНаценки;
		Если ЗначениеЗаполнено(ДокументСсылка.ВидЦен) Тогда
		    ДокументОбъект.ВидЦен				= ДокументСсылка.ВидЦен;
		Иначе
			ДокументОбъект.ВидЦен				= ДокументОбъект.Договор.ВидЦен;
		КонецЕсли; 
		
		ДокументОбъект.СуммаВключаетНДС		= ДокументОбъект.ВидЦен.ЦенаВключаетНДС;
		ДокументОбъект.ТранспортноеСредство	= ДокументОбъект.ТранспортноеСредство;
		
		// Найдём банковский счет и кассу по организации и валюте		
		// Если основной банковский счет организации имеет туже валюту что валюта документа используем его в документе
		Если ДокументОбъект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = ДокументОбъект.ВалютаДокумента Тогда 
			ДокументОбъект.БанковскийСчет = ДокументОбъект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
		КонецЕсли;
		
		
		
		ДокументОбъект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(ДокументОбъект.Организация,, ДокументОбъект.Дата);
		//ДокументОбъект.НалогообложениеНДС = ПроведениеНДС_И_RSGE.ПолучитьЗначечениеНалогооблажение(ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.Договор, ДокументОбъект.Дата, Истина);
		
		// Заполним товары
		Для Каждого Эл Из ДокументСсылка.Реализация Цикл
			СтрокаЗапасы = ДокументОбъект.Запасы.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Эл);
			СтрокаЗапасы.ЭтоПодарок=Эл.Подарок;
			// Заполним единицу измерения  базовой единице (в документе визит нет единицы!!!)
			СтрокаЗапасы.ЕдиницаИзмерения	= СтрокаЗапасы.Номенклатура.ЕдиницаИзмерения;
			
			// Расчет суммы НДС
			СтрокаЗапасы.СтавкаНДС	= СтрокаЗапасы.Номенклатура.СтавкаНДС;
			СтрокаЗапасы.ТипНоменклатурыЗапас = Истина;
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаЗапасы.СтавкаНДС);
			
			Если ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда 
				СтрокаЗапасы.СуммаНДС = ?(ДокументОбъект.СуммаВключаетНДС, СтрокаЗапасы.Сумма - (СтрокаЗапасы.Сумма) / ((СтавкаНДС + 100) / 100),
										  							СтрокаЗапасы.Сумма * СтавкаНДС / 100);
			Иначе
				СтрокаЗапасы.СуммаНДС = 0;
			КонецЕсли;
			
			СтрокаЗапасы.Всего		= ?(ДокументОбъект.СуммаВключаетНДС, СтрокаЗапасы.Сумма, СтрокаЗапасы.Сумма + СтрокаЗапасы.СуммаНДС);
		КонецЦикла;		
		
		// Если документ был помечен на удаление снимим пометку
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Иначе
		
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
		    ДокументОбъект.УстановитьПометкуУдаления(Истина);
		    ДокументОбъект.Записать();
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ДокументОбъект.Ссылка;	
КонецФункции

Функция НайтиИлиСоздатьДокументПКО(ДокументСсылка) Экспорт
	Документ = Документы.ПоступлениеВКассу.НайтиПоРеквизиту("ДокументВизита", ДокументСсылка);
	
	// Если документ не был найден то создадим его
	Если Документ.Пустая() Тогда 
	    ДокументОбъект = Документы.ПоступлениеВКассу.СоздатьДокумент();
		ДокументОбъект.ДокументВизита = ДокументСсылка;
	Иначе 
		ДокументОбъект = Документ.ПолучитьОбъект();
	КонецЕсли;
	
	ДокументОбъект.РасшифровкаПлатежа.Очистить();
	
	Если ДокументСсылка.СуммаПолученная > 0 Тогда	
        ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ОтПокупателя;
		
		СостояниеДокумента = "";
		КартинкаСостоянияДокумента = 0;
		РазрешеноПроведение = Истина;
		
		УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
			ДокументОбъект, 
			ДокументОбъект.ВидОперации,
			Документы.ЗаказПокупателя.ПустаяСсылка(), // Пустая ссылка на документ для парамента копирования
			Неопределено,  // Основание для создания
			СостояниеДокумента,
			Новый Структура() // Параметры заполнения
		);
		
		// Заполним реквизиты по документу "Визит"
		ДокументОбъект.Дата			= ДокументСсылка.Дата;
		ДокументОбъект.Автор		= ДокументСсылка.Автор;
		ДокументОбъект.ТорговаяТочка= ДокументСсылка.ТорговаяТочка;
		ДокументОбъект.Комментарий	= ДокументСсылка.Комментарий;
		
		ДокументОбъект.Контрагент	= ДокументСсылка.Контрагент;
		//ДокументОбъект.Договор      = ДокументСсылка.Договор;
		
		//ДокументОбъект.Договор		= ДокументОбъект.ТорговаяТочка.Договор; //договор указываеться в табличной части расшифровки платежа
		ДокументОбъект.Организация	= ДокументСсылка.Договор.Организация;
		ДокументОбъект.Касса		= ДокументСсылка.Касса;
		
		ДокументОбъект.СуммаДокумента	= ДокументСсылка.СуммаПолученная;
		ДокументОбъект.Статья			= Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей;
		// Заполним валюту и курс по валюте из договора
		ДокументОбъект.ВалютаДенежныхСредств= ДокументОбъект.Касса.ВалютаПоУмолчанию;
		ВалютаРасчетовКурсКратность			= РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", ДокументОбъект.Касса.ВалютаПоУмолчанию));
		ДокументОбъект.Курс					= ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
		ДокументОбъект.Кратность			= ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);

		//СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
		//
		//СтрокаРасшифровки.Договор = ДокументСсылка.Договор;
		//
		//ВалютаРасчетовКурсКратность	= РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", СтрокаРасшифровки.Договор.ВалютаРасчетов));
		//СтрокаРасшифровки.Курс		= ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
		//СтрокаРасшифровки.Кратность	= ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
		//СтрокаРасшифровки.СуммаРасчетов	= ДокументСсылка.СуммаПолученная;
		//СтрокаРасшифровки.СуммаПлатежа	= СтрокаРасшифровки.СуммаРасчетов * СтрокаРасшифровки.Курс / СтрокаРасшифровки.Кратность;
		
		ЗаполнитьРасшифровкуПлатежа(ДокументОбъект,ДокументСсылка.Договор);
		
		// Если документ был помечен на удаление снимим пометку
		// Kuzmich, 20.05.2019, ошибка проведения документа Визит
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
			Если ДокументОбъект.ПометкаУдаления Тогда
				ДокументОбъект.УстановитьПометкуУдаления(ЛОЖЬ);
			КонецЕсли;
		КонецЕсли;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		// Kuzmich, 20.05.2019, ошибка проведения документа Визит
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный); // Сначала запишем документ
			//ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		Исключение
			//Попытка
			//	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись); // Сначала запишем документ
			//	//ДокументОбъект.УстановитьПометкуУдаления(Ложь);
			//Исключение
			//КонецПопытки;
			
			// Kuzmich, 20.05.2019, ошибка проведения документа Визит
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			
			Возврат ДокументОбъект.Ссылка;
			// Kuzmich, 20.05.2019, ошибка проведения документа Визит
		КонецПопытки;
		
		//ДокументОбъект.Записать();  // временная заглушка
		//ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Иначе
		
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
			ДокументОбъект.Записать();
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ДокументОбъект.Ссылка;		
КонецФункции

Функция НайтиИлиСоздатьДокументЗаказНаВозврат(ДокументСсылка) Экспорт
	
	Документ = Документы.ЗаказНаВозврат.НайтиПоРеквизиту("ДокументВизита", ДокументСсылка);
	
	// Если документ не был найден то создадим его
	Если Документ.Пустая() Тогда 
	    ДокументОбъект = Документы.ЗаказНаВозврат.СоздатьДокумент();
		ДокументОбъект.ДокументВизита = ДокументСсылка;
	Иначе 
		ДокументОбъект = Документ.ПолучитьОбъект();
	КонецЕсли;
	
	ДокументОбъект.Запасы.Очистить();
	
	Если ДокументСсылка.ЗаказНаВозврат.Количество() > 0 Тогда	
		// Заполним реквизиты по документу "Визит"
		ДокументОбъект.Дата						= ДокументСсылка.Дата;
		ДокументОбъект.Автор					= ДокументСсылка.Автор;
		ДокументОбъект.ТорговаяТочка			= ДокументСсылка.ТорговаяТочка;
		ДокументОбъект.Комментарий				= ДокументСсылка.Комментарий;
		
		ДокументОбъект.Контрагент				= ДокументСсылка.Контрагент;
		ДокументОбъект.Договор					= ДокументСсылка.Договор;
		ДокументОбъект.Организация				= ДокументОбъект.Договор.Организация;
		
		ДокументОбъект.НомерВходящегоДокумента	= ДокументСсылка.Номер;
		ДокументОбъект.ДатаВходящегоДокумента	= ДокументСсылка.Дата;
		
		// Заполним товары
		Для Каждого Эл Из ДокументСсылка.ЗаказНаВозврат Цикл
			СтрокаЗапасы = ДокументОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Эл);
		КонецЦикла;		
		
		// Если документ был помечен на удаление снимим пометку
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Иначе
		
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
		    ДокументОбъект.УстановитьПометкуУдаления(Истина);
		    ДокументОбъект.Записать();
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьРасшифровкуПлатежа(ТекущийОбъект,обДоговор)
	
	//Если ТекущийОбъект = Неопределено Тогда
	//	ТекущийОбъект = Объект;
	//КонецЕсли;
	
	// Заполнение расшифровки расчетов по умолчанию.
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	РасчетыСПокупателямиОстатки.Организация КАК Организация,
	|	РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА РасчетыСПокупателямиОстатки.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА РасчетыСПокупателямиОстатки.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ТипРасчетов КАК ТипРасчетов,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
	|	РасчетыСПокупателямиОстатки.Документ.Дата КАК ДокументДата,
	|	СУММА(ВЫРАЗИТЬ(РасчетыСПокупателямиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаВалДокумента,
	|	КурсыВалютДокумента.Курс КАК КурсДенежныхСредств,
	|	КурсыВалютДокумента.Кратность КАК КратностьДенежныхСредств,
	|	КурсыВалютРасчетов.Курс КАК Курс,
	|	КурсыВалютРасчетов.Кратность КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПокупателямиОстатки.Организация КАК Организация,
	|		РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|		РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|		РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|		РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|		РасчетыСПокупателямиОстатки.ТипРасчетов КАК ТипРасчетов,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями.Остатки(
	|				,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					И Договор = &Договор) КАК РасчетыСПокупателямиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПокупателями.Организация,
	|		ДвиженияДокументаРасчетыСПокупателями.Контрагент,
	|		ДвиженияДокументаРасчетыСПокупателями.Договор,
	|		ДвиженияДокументаРасчетыСПокупателями.Документ,
	|		ДвиженияДокументаРасчетыСПокупателями.Заказ,
	|		ДвиженияДокументаРасчетыСПокупателями.ТипРасчетов,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокументаРасчетыСПокупателями
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПокупателями.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПокупателями.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПокупателями.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПокупателями.Контрагент = &Контрагент
	|		И ДвиженияДокументаРасчетыСПокупателями.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		И ДвиженияДокументаРасчетыСПокупателями.Договор = &Договор) КАК РасчетыСПокупателямиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютДокумента
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|		ПО РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	РасчетыСПокупателямиОстатки.СуммаВалОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Организация,
	|	РасчетыСПокупателямиОстатки.Контрагент,
	|	РасчетыСПокупателямиОстатки.Договор,
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ТипРасчетов,
	|	РасчетыСПокупателямиОстатки.Документ.Дата,
	|	КурсыВалютДокумента.Курс,
	|	КурсыВалютДокумента.Кратность,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА РасчетыСПокупателямиОстатки.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА РасчетыСПокупателямиОстатки.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
		
	Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект.Контрагент);
	Запрос.УстановитьПараметр("Период", ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("Валюта", ТекущийОбъект.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("Договор",обДоговор);
	
	НуженОтборПоДоговорам = УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов();
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(ТекущийОбъект.Ссылка, ТекущийОбъект.ВидОперации);
	Если НуженОтборПоДоговорам
	   И ТекущийОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорОтбор", "И Договор.ВидДоговора В (&СписокВидовДоговоров)");
		Запрос.УстановитьПараметр("СписокВидовДоговоров", СписокВидовДоговоров);
	КонецЕсли;
	
	ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(
		ТекущийОбъект.Контрагент,
		ТекущийОбъект.Организация,
		СписокВидовДоговоров
	);
	
	СтруктураКурсВалютыДоговораПоУмолчанию = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
		ТекущийОбъект.Дата,
		Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов)
	);
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	ТекущийОбъект.РасшифровкаПлатежа.Очистить();
	
	СуммаОсталосьРаспределить = ТекущийОбъект.СуммаДокумента;
	
	//СтрокаРасшифровки = ТекущийОбъект.РасшифровкаПлатежа.Добавить();
	//
	//СтрокаРасшифровки.Договор = ДокументСсылка.Договор;
	//
	ВалютаРасчетовКурсКратность	= РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущийОбъект.Дата, Новый Структура("Валюта", обДоговор.ВалютаРасчетов));
	//СтрокаРасшифровки.Курс		= ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
	//СтрокаРасшифровки.Кратность	= ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
	//СтрокаРасшифровки.СуммаРасчетов	= ДокументСсылка.СуммаПолученная;
	//СтрокаРасшифровки.СуммаПлатежа	= СтрокаРасшифровки.СуммаРасчетов * СтрокаРасшифровки.Курс / СтрокаРасшифровки.Кратность;

	
	Пока СуммаОсталосьРаспределить > 0 Цикл
		
		НоваяСтрока = ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			// Kuzmich, 20.05.2019, ошибка проведения документа Визит
			НоваяСтрока.Договор = обДоговор;
			// Kuzmich, 20.05.2019, ошибка проведения документа Визит
			Если ВыборкаРезультатаЗапроса.СуммаВалДокумента <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
				
				НоваяСтрока.СуммаРасчетов = ВыборкаРезультатаЗапроса.СуммаВалОстаток;
				НоваяСтрока.СуммаПлатежа = ВыборкаРезультатаЗапроса.СуммаВалДокумента;
				//НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
				//НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа);
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.СуммаВалДокумента;
				
			Иначе // сумма остатка больше чем нужно распределить
				
				НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
					СуммаОсталосьРаспределить,
					ВыборкаРезультатаЗапроса.КурсДенежныхСредств,
					ВыборкаРезультатаЗапроса.Курс,
					ВыборкаРезультатаЗапроса.КратностьДенежныхСредств,
					ВыборкаРезультатаЗапроса.Кратность
				);
				НоваяСтрока.СуммаПлатежа = СуммаОсталосьРаспределить;
				//НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
				//НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
		Иначе
			
			//НоваяСтрока.Договор = ДоговорПоУмолчанию;
			// Kuzmich, 20.05.2019, ошибка проведения документа Визит
			НоваяСтрока.Договор = обДоговор;
			// Kuzmich, 20.05.2019, ошибка проведения документа Визит
			НоваяСтрока.Курс = ?(
				СтруктураКурсВалютыДоговораПоУмолчанию.Курс = 0,
				1,
				СтруктураКурсВалютыДоговораПоУмолчанию.Курс
			);
			НоваяСтрока.Кратность = ?(
				СтруктураКурсВалютыДоговораПоУмолчанию.Кратность = 0,
				1,
				СтруктураКурсВалютыДоговораПоУмолчанию.Кратность
			);
			НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				СуммаОсталосьРаспределить,
				ВалютаРасчетовКурсКратность.Курс,
				НоваяСтрока.Курс,
				ВалютаРасчетовКурсКратность.Кратность,
				НоваяСтрока.Кратность
			);
			НоваяСтрока.ПризнакАванса = Истина;
			НоваяСтрока.СуммаПлатежа = СуммаОсталосьРаспределить;
			//НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
			//НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
			СуммаОсталосьРаспределить = 0;
			
		КонецЕсли;
		
		НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НДС18;
		
	КонецЦикла;
	
	Если ТекущийОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		ТекущийОбъект.РасшифровкаПлатежа[0].СуммаПлатежа = ТекущийОбъект.СуммаДокумента;
	КонецЕсли;
	
	//СуммаПлатежа = ТекущийОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

Функция НайтиИлиСоздатьДокументВнутреннийЗаказ(ДокументСсылка) Экспорт
	Документ = Документы.ВнутреннийЗаказ.НайтиПоРеквизиту("ДокументВизита", ДокументСсылка);
	
	// Если документ не был найден то создадим его
	Если Документ.Пустая() Тогда 
	    ДокументОбъект = Документы.ВнутреннийЗаказ.СоздатьДокумент();
		ДокументОбъект.ДокументВизита = ДокументСсылка;
	Иначе 
		ДокументОбъект = Документ.ПолучитьОбъект();		
	КонецЕсли;
	
	ДокументОбъект.Запасы.Очистить();
	
	Если ДокументСсылка.ВнутреннийЗаказ.Количество() > 0 Тогда 
		
		СостояниеДокумента = "";
		КартинкаСостоянияДокумента = 0;
		РазрешеноПроведение = Истина;
		
		УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
			ДокументОбъект, 
			"",
			Документы.ВнутреннийЗаказ.ПустаяСсылка(), // Пустая ссылка на документ для парамента копирования
			Неопределено,  // Основание для создания
			СостояниеДокумента,
			Новый Структура() // Параметры заполнения
		);
		
		// Заполним реквизиты по документу "Визит"
		ДокументОбъект.Дата			= ДокументСсылка.Дата;
		ДокументОбъект.Автор		= ДокументСсылка.Автор;
		ДокументОбъект.Комментарий	= ДокументСсылка.Комментарий;
		ДокументОбъект.Ответственный= ДокументСсылка.Ответственный;
		
		ДокументОбъект.СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
		
		
		// Заполним товары
		Для Каждого Эл Из ДокументСсылка.ВнутреннийЗаказ Цикл
			СтрокаЗапасы = ДокументОбъект.Запасы.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Эл);
			
			// Заполним единицу измерения  базовой единице (в документе визит нет единицы!!!)
			СтрокаЗапасы.ЕдиницаИзмерения	= СтрокаЗапасы.Номенклатура.ЕдиницаИзмерения;
			
		КонецЦикла;

		// Если документ был помечен на удаление снимим пометку
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;

		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
	Иначе
		
		Если Не ДокументОбъект.ЭтоНовый() Тогда 
			ДокументОбъект.Записать(); // Сначала запишем документ
		    ДокументОбъект.УстановитьПометкуУдаления(Истина);
		    ДокументОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДокументОбъект.Ссылка;	
КонецФункции
